ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/dio.xml
<module id="DIO" HW_revision=""><register id="PAIN" width="16" offset="0x0" internal="0" description="Port A Input"><bitfield id="P1IN" description="Port 1 Input" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2IN" description="Port 2 Input" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PAOUT" width="16" offset="0x2" internal="0" description="Port A Output"><bitfield id="P1OUT" description="Port 1 Output" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2OUT" description="Port 2 Output" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PADIR" width="16" offset="0x4" internal="0" description="Port A Direction"><bitfield id="P1DIR" description="Port 1 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2DIR" description="Port 2 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PAREN" width="16" offset="0x6" internal="0" description="Port A Resistor Enable"><bitfield id="P1REN" description="Port 1 pullup or pulldown resistor enable" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2REN" description="Port 2 pullup or pulldown resistor enable" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PADS" width="16" offset="0x8" internal="0" description="Port A Drive Strength"><bitfield id="P1DS" description="Port 1 drive strength selection (for high drive strength I/Os)" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2DS" description="Port 2 drive strength selection (for high drive strength I/Os)" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PASEL0" width="16" offset="0xA" internal="0" description="Port A Select 0"><bitfield id="P1SEL0" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2SEL0" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PASEL1" width="16" offset="0xC" internal="0" description="Port A Select 1"><bitfield id="P1SEL1" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2SEL1" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P1IV" width="16" offset="0xE" internal="0" description="Port 1 Interrupt Vector Register"><bitfield id="P1IV" description="Port 1 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P1IV__0" value="0" description="No interrupt pending"/><bitenum id="P1IV__2" value="2" description="Interrupt Source: Port 1"/><bitenum id="P1IV__4" value="4" description="Interrupt Source: Port 1.1 interrupt; Interrupt Flag: P1IFG1"/><bitenum id="P1IV__6" value="6" description="Interrupt Source: Port 1.2 interrupt; Interrupt Flag: P1IFG2"/><bitenum id="P1IV__8" value="8" description="Interrupt Source: Port 1.3 interrupt; Interrupt Flag: P1IFG3"/><bitenum id="P1IV__16" value="10" description="Interrupt Source: Port 1.4 interrupt; Interrupt Flag: P1IFG4"/><bitenum id="P1IV__18" value="12" description="Interrupt Source: Port 1.5 interrupt; Interrupt Flag: P1IFG5"/><bitenum id="P1IV__20" value="14" description="Interrupt Source: Port 1.6 interrupt; Interrupt Flag: P1IFG6"/><bitenum id="P1IV__22" value="16" description="Interrupt Source: Port 1"/></bitfield></register><register id="PASELC" width="16" offset="0x16" internal="0" description="Port A Complement Select"><bitfield id="P1SELC" description="Port selection complement" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2SELC" description="Port selection complement" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PAIES" width="16" offset="0x18" internal="0" description="Port A Interrupt Edge Select"><bitfield id="P1IES" description="Port 1 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2IES" description="Port 2 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PAIE" width="16" offset="0x1A" internal="0" description="Port A Interrupt Enable"><bitfield id="P1IE" description="Port 1 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2IE" description="Port 2 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PAIFG" width="16" offset="0x1C" internal="0" description="Port A Interrupt Flag"><bitfield id="P1IFG" description="Port 1 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P2IFG" description="Port 2 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P2IV" width="16" offset="0x1E" internal="0" description="Port 2 Interrupt Vector Register"><bitfield id="P2IV" description="Port 2 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P2IV__0" value="0" description="No interrupt pending"/><bitenum id="P2IV__2" value="2" description="Interrupt Source: Port 2"/><bitenum id="P2IV__4" value="4" description="Interrupt Source: Port 2.1 interrupt; Interrupt Flag: P2IFG1"/><bitenum id="P2IV__6" value="6" description="Interrupt Source: Port 2.2 interrupt; Interrupt Flag: P2IFG2"/><bitenum id="P2IV__8" value="8" description="Interrupt Source: Port 2.3 interrupt; Interrupt Flag: P2IFG3"/><bitenum id="P2IV__16" value="10" description="Interrupt Source: Port 2.4 interrupt; Interrupt Flag: P2IFG4"/><bitenum id="P2IV__18" value="12" description="Interrupt Source: Port 2.5 interrupt; Interrupt Flag: P2IFG5"/><bitenum id="P2IV__20" value="14" description="Interrupt Source: Port 2.6 interrupt; Interrupt Flag: P2IFG6"/><bitenum id="P2IV__22" value="16" description="Interrupt Source: Port 2"/></bitfield></register><register id="PBIN" width="16" offset="0x20" internal="0" description="Port B Input"><bitfield id="P3IN" description="Port 3 Input" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4IN" description="Port 4 Input" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBOUT" width="16" offset="0x22" internal="0" description="Port B Output"><bitfield id="P3OUT" description="Port 3 Output" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4OUT" description="Port 4 Output" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBDIR" width="16" offset="0x24" internal="0" description="Port B Direction"><bitfield id="P3DIR" description="Port 3 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4DIR" description="Port 4 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBREN" width="16" offset="0x26" internal="0" description="Port B Resistor Enable"><bitfield id="P3REN" description="Port 3 pullup or pulldown resistor enable" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4REN" description="Port 4 pullup or pulldown resistor enable" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBDS" width="16" offset="0x28" internal="0" description="Port B Drive Strength"><bitfield id="P3DS" description="Port 3 drive strength selection (for high drive strength I/Os)" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4DS" description="Port 4 drive strength selection (for high drive strength I/Os)" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBSEL0" width="16" offset="0x2A" internal="0" description="Port B Select 0"><bitfield id="P3SEL0" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4SEL0" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBSEL1" width="16" offset="0x2C" internal="0" description="Port B Select 1"><bitfield id="P3SEL1" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4SEL1" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P3IV" width="16" offset="0x2E" internal="0" description="Port 3 Interrupt Vector Register"><bitfield id="P3IV" description="Port 3 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P3IV__0" value="0" description="No interrupt pending"/><bitenum id="P3IV__2" value="2" description="Interrupt Source: Port 3"/><bitenum id="P3IV__4" value="4" description="Interrupt Source: Port 3.1 interrupt; Interrupt Flag: P3IFG1"/><bitenum id="P3IV__6" value="6" description="Interrupt Source: Port 3.2 interrupt; Interrupt Flag: P3IFG2"/><bitenum id="P3IV__8" value="8" description="Interrupt Source: Port 3.3 interrupt; Interrupt Flag: P3IFG3"/><bitenum id="P3IV__16" value="10" description="Interrupt Source: Port 3.4 interrupt; Interrupt Flag: P3IFG4"/><bitenum id="P3IV__18" value="12" description="Interrupt Source: Port 3.5 interrupt; Interrupt Flag: P3IFG5"/><bitenum id="P3IV__20" value="14" description="Interrupt Source: Port 3.6 interrupt; Interrupt Flag: P3IFG6"/><bitenum id="P3IV__22" value="16" description="Interrupt Source: Port 3"/></bitfield></register><register id="PBSELC" width="16" offset="0x36" internal="0" description="Port B Complement Select"><bitfield id="P3SELC" description="Port selection complement" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4SELC" description="Port selection complement" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBIES" width="16" offset="0x38" internal="0" description="Port B Interrupt Edge Select"><bitfield id="P3IES" description="Port 3 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4IES" description="Port 4 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBIE" width="16" offset="0x3A" internal="0" description="Port B Interrupt Enable"><bitfield id="P3IE" description="Port 3 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4IE" description="Port 4 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PBIFG" width="16" offset="0x3C" internal="0" description="Port B Interrupt Flag"><bitfield id="P3IFG" description="Port 3 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P4IFG" description="Port 4 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P4IV" width="16" offset="0x3E" internal="0" description="Port 4 Interrupt Vector Register"><bitfield id="P4IV" description="Port 4 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P4IV__0" value="0" description="No interrupt pending"/><bitenum id="P4IV__2" value="2" description="Interrupt Source: Port 4"/><bitenum id="P4IV__4" value="4" description="Interrupt Source: Port 4.1 interrupt; Interrupt Flag: P4IFG1"/><bitenum id="P4IV__6" value="6" description="Interrupt Source: Port 4.2 interrupt; Interrupt Flag: P4IFG2"/><bitenum id="P4IV__8" value="8" description="Interrupt Source: Port 4.3 interrupt; Interrupt Flag: P4IFG3"/><bitenum id="P4IV__16" value="10" description="Interrupt Source: Port 4.4 interrupt; Interrupt Flag: P4IFG4"/><bitenum id="P4IV__18" value="12" description="Interrupt Source: Port 4.5 interrupt; Interrupt Flag: P4IFG5"/><bitenum id="P4IV__20" value="14" description="Interrupt Source: Port 4.6 interrupt; Interrupt Flag: P4IFG6"/><bitenum id="P4IV__22" value="16" description="Interrupt Source: Port 4"/></bitfield></register><register id="PCIN" width="16" offset="0x40" internal="0" description="Port C Input"><bitfield id="P5IN" description="Port 5 Input" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6IN" description="Port 6 Input" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCOUT" width="16" offset="0x42" internal="0" description="Port C Output"><bitfield id="P5OUT" description="Port 5 Output" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6OUT" description="Port 6 Output" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCDIR" width="16" offset="0x44" internal="0" description="Port C Direction"><bitfield id="P5DIR" description="Port 5 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6DIR" description="Port 6 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCREN" width="16" offset="0x46" internal="0" description="Port C Resistor Enable"><bitfield id="P5REN" description="Port 5 pullup or pulldown resistor enable" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6REN" description="Port 6 pullup or pulldown resistor enable" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCDS" width="16" offset="0x48" internal="0" description="Port C Drive Strength"><bitfield id="P5DS" description="Port 5 drive strength selection (for high drive strength I/Os)" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6DS" description="Port 6 drive strength selection (for high drive strength I/Os)" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCSEL0" width="16" offset="0x4A" internal="0" description="Port C Select 0"><bitfield id="P5SEL0" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6SEL0" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCSEL1" width="16" offset="0x4C" internal="0" description="Port C Select 1"><bitfield id="P5SEL1" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6SEL1" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P5IV" width="16" offset="0x4E" internal="0" description="Port 5 Interrupt Vector Register"><bitfield id="P5IV" description="Port 5 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P5IV__0" value="0" description="No interrupt pending"/><bitenum id="P5IV__2" value="2" description="Interrupt Source: Port 5"/><bitenum id="P5IV__4" value="4" description="Interrupt Source: Port 5.1 interrupt; Interrupt Flag: P5IFG1"/><bitenum id="P5IV__6" value="6" description="Interrupt Source: Port 5.2 interrupt; Interrupt Flag: P5IFG2"/><bitenum id="P5IV__8" value="8" description="Interrupt Source: Port 5.3 interrupt; Interrupt Flag: P5IFG3"/><bitenum id="P5IV__16" value="10" description="Interrupt Source: Port 5.4 interrupt; Interrupt Flag: P5IFG4"/><bitenum id="P5IV__18" value="12" description="Interrupt Source: Port 5.5 interrupt; Interrupt Flag: P5IFG5"/><bitenum id="P5IV__20" value="14" description="Interrupt Source: Port 5.6 interrupt; Interrupt Flag: P5IFG6"/><bitenum id="P5IV__22" value="16" description="Interrupt Source: Port 5"/></bitfield></register><register id="PCSELC" width="16" offset="0x56" internal="0" description="Port C Complement Select"><bitfield id="P5SELC" description="Port selection complement" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6SELC" description="Port selection complement" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCIES" width="16" offset="0x58" internal="0" description="Port C Interrupt Edge Select"><bitfield id="P5IES" description="Port 5 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6IES" description="Port 6 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCIE" width="16" offset="0x5A" internal="0" description="Port C Interrupt Enable"><bitfield id="P5IE" description="Port 5 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6IE" description="Port 6 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PCIFG" width="16" offset="0x5C" internal="0" description="Port C Interrupt Flag"><bitfield id="P5IFG" description="Port 5 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P6IFG" description="Port 6 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P6IV" width="16" offset="0x5E" internal="0" description="Port 6 Interrupt Vector Register"><bitfield id="P6IV" description="Port 6 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P6IV__0" value="0" description="No interrupt pending"/><bitenum id="P6IV__2" value="2" description="Interrupt Source: Port 6"/><bitenum id="P6IV__4" value="4" description="Interrupt Source: Port 6.1 interrupt; Interrupt Flag: P6IFG1"/><bitenum id="P6IV__6" value="6" description="Interrupt Source: Port 6.2 interrupt; Interrupt Flag: P6IFG2"/><bitenum id="P6IV__8" value="8" description="Interrupt Source: Port 6.3 interrupt; Interrupt Flag: P6IFG3"/><bitenum id="P6IV__16" value="10" description="Interrupt Source: Port 6.4 interrupt; Interrupt Flag: P6IFG4"/><bitenum id="P6IV__18" value="12" description="Interrupt Source: Port 6.5 interrupt; Interrupt Flag: P6IFG5"/><bitenum id="P6IV__20" value="14" description="Interrupt Source: Port 6.6 interrupt; Interrupt Flag: P6IFG6"/><bitenum id="P6IV__22" value="16" description="Interrupt Source: Port 6"/></bitfield></register><register id="PDIN" width="16" offset="0x60" internal="0" description="Port D Input"><bitfield id="P7IN" description="Port 7 Input" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8IN" description="Port 8 Input" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDOUT" width="16" offset="0x62" internal="0" description="Port D Output"><bitfield id="P7OUT" description="Port 7 Output" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8OUT" description="Port 8 Output" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDDIR" width="16" offset="0x64" internal="0" description="Port D Direction"><bitfield id="P7DIR" description="Port 7 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8DIR" description="Port 8 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDREN" width="16" offset="0x66" internal="0" description="Port D Resistor Enable"><bitfield id="P7REN" description="Port 7 pullup or pulldown resistor enable" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8REN" description="Port 8 pullup or pulldown resistor enable" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDDS" width="16" offset="0x68" internal="0" description="Port D Drive Strength"><bitfield id="P7DS" description="Port 7 drive strength selection (for high drive strength I/Os)" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8DS" description="Port 8 drive strength selection (for high drive strength I/Os)" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDSEL0" width="16" offset="0x6A" internal="0" description="Port D Select 0"><bitfield id="P7SEL0" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8SEL0" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDSEL1" width="16" offset="0x6C" internal="0" description="Port D Select 1"><bitfield id="P7SEL1" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8SEL1" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P7IV" width="16" offset="0x6E" internal="0" description="Port 7 Interrupt Vector Register"><bitfield id="P7IV" description="Port 7 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P7IV__0" value="0" description="No interrupt pending"/><bitenum id="P7IV__2" value="2" description="Interrupt Source: Port 7"/><bitenum id="P7IV__4" value="4" description="Interrupt Source: Port 7.1 interrupt; Interrupt Flag: P7IFG1"/><bitenum id="P7IV__6" value="6" description="Interrupt Source: Port 7.2 interrupt; Interrupt Flag: P7IFG2"/><bitenum id="P7IV__8" value="8" description="Interrupt Source: Port 7.3 interrupt; Interrupt Flag: P7IFG3"/><bitenum id="P7IV__16" value="10" description="Interrupt Source: Port 7.4 interrupt; Interrupt Flag: P7IFG4"/><bitenum id="P7IV__18" value="12" description="Interrupt Source: Port 7.5 interrupt; Interrupt Flag: P7IFG5"/><bitenum id="P7IV__20" value="14" description="Interrupt Source: Port 7.6 interrupt; Interrupt Flag: P7IFG6"/><bitenum id="P7IV__22" value="16" description="Interrupt Source: Port 7"/></bitfield></register><register id="PDSELC" width="16" offset="0x76" internal="0" description="Port D Complement Select"><bitfield id="P7SELC" description="Port selection complement" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8SELC" description="Port selection complement" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDIES" width="16" offset="0x78" internal="0" description="Port D Interrupt Edge Select"><bitfield id="P7IES" description="Port 7 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8IES" description="Port 8 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDIE" width="16" offset="0x7A" internal="0" description="Port D Interrupt Enable"><bitfield id="P7IE" description="Port 7 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8IE" description="Port 8 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PDIFG" width="16" offset="0x7C" internal="0" description="Port D Interrupt Flag"><bitfield id="P7IFG" description="Port 7 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P8IFG" description="Port 8 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P8IV" width="16" offset="0x7E" internal="0" description="Port 8 Interrupt Vector Register"><bitfield id="P8IV" description="Port 8 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P8IV__0" value="0" description="No interrupt pending"/><bitenum id="P8IV__2" value="2" description="Interrupt Source: Port 8"/><bitenum id="P8IV__4" value="4" description="Interrupt Source: Port 8.1 interrupt; Interrupt Flag: P8IFG1"/><bitenum id="P8IV__6" value="6" description="Interrupt Source: Port 8.2 interrupt; Interrupt Flag: P8IFG2"/><bitenum id="P8IV__8" value="8" description="Interrupt Source: Port 8.3 interrupt; Interrupt Flag: P8IFG3"/><bitenum id="P8IV__16" value="10" description="Interrupt Source: Port 8.4 interrupt; Inter