ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/dio.xml
rupt Flag: P8IFG4"/><bitenum id="P8IV__18" value="12" description="Interrupt Source: Port 8.5 interrupt; Interrupt Flag: P8IFG5"/><bitenum id="P8IV__20" value="14" description="Interrupt Source: Port 8.6 interrupt; Interrupt Flag: P8IFG6"/><bitenum id="P8IV__22" value="16" description="Interrupt Source: Port 8"/></bitfield></register><register id="PEIN" width="16" offset="0x80" internal="0" description="Port E Input"><bitfield id="P9IN" description="Port 9 Input" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10IN" description="Port 10 Input" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEOUT" width="16" offset="0x82" internal="0" description="Port E Output"><bitfield id="P9OUT" description="Port 9 Output" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10OUT" description="Port 10 Output" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEDIR" width="16" offset="0x84" internal="0" description="Port E Direction"><bitfield id="P9DIR" description="Port 9 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10DIR" description="Port 10 Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port con" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEREN" width="16" offset="0x86" internal="0" description="Port E Resistor Enable"><bitfield id="P9REN" description="Port 9 pullup or pulldown resistor enable" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10REN" description="Port 10 pullup or pulldown resistor enable" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEDS" width="16" offset="0x88" internal="0" description="Port E Drive Strength"><bitfield id="P9DS" description="Port 9 drive strength selection (for high drive strength I/Os)" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10DS" description="Port 10 drive strength selection (for high drive strength I/Os)" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PESEL0" width="16" offset="0x8A" internal="0" description="Port E Select 0"><bitfield id="P9SEL0" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10SEL0" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PESEL1" width="16" offset="0x8C" internal="0" description="Port E Select 1"><bitfield id="P9SEL1" description="Port function selection" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10SEL1" description="Port function selection" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P9IV" width="16" offset="0x8E" internal="0" description="Port 9 Interrupt Vector Register"><bitfield id="P9IV" description="Port 9 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P9IV__0" value="0" description="No interrupt pending"/><bitenum id="P9IV__2" value="2" description="Interrupt Source: Port 9"/><bitenum id="P9IV__4" value="4" description="Interrupt Source: Port 9.1 interrupt; Interrupt Flag: P9IFG1"/><bitenum id="P9IV__6" value="6" description="Interrupt Source: Port 9.2 interrupt; Interrupt Flag: P9IFG2"/><bitenum id="P9IV__8" value="8" description="Interrupt Source: Port 9.3 interrupt; Interrupt Flag: P9IFG3"/><bitenum id="P9IV__16" value="10" description="Interrupt Source: Port 9.4 interrupt; Interrupt Flag: P9IFG4"/><bitenum id="P9IV__18" value="12" description="Interrupt Source: Port 9.5 interrupt; Interrupt Flag: P9IFG5"/><bitenum id="P9IV__20" value="14" description="Interrupt Source: Port 9.6 interrupt; Interrupt Flag: P9IFG6"/><bitenum id="P9IV__22" value="16" description="Interrupt Source: Port 9"/></bitfield></register><register id="PESELC" width="16" offset="0x96" internal="0" description="Port E Complement Select"><bitfield id="P9SELC" description="Port selection complement" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10SELC" description="Port selection complement" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEIES" width="16" offset="0x98" internal="0" description="Port E Interrupt Edge Select"><bitfield id="P9IES" description="Port 9 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a low" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10IES" description="Port 10 interrupt edge select&#13;&#10;0b = PxIFG flag is set with a lo" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEIE" width="16" offset="0x9A" internal="0" description="Port E Interrupt Enable"><bitfield id="P9IE" description="Port 9 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt disa" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10IE" description="Port 10 Interrupt Enable&#13;&#10;0b = Corresponding port interrupt dis" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="PEIFG" width="16" offset="0x9C" internal="0" description="Port E Interrupt Flag"><bitfield id="P9IFG" description="Port 9 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="P10IFG" description="Port 10 Interrupt Flag&#13;&#10;0b = No interrupt is pending" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="P10IV" width="16" offset="0x9E" internal="0" description="Port 10 Interrupt Vector Register"><bitfield id="P10IV" description="Port 10 interrupt vector value" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="P10IV__0" value="0" description="No interrupt pending"/><bitenum id="P10IV__2" value="2" description="Interrupt Source: Port 10"/><bitenum id="P10IV__4" value="4" description="Interrupt Source: Port 10.1 interrupt; Interrupt Flag: P10IFG1"/><bitenum id="P10IV__6" value="6" description="Interrupt Source: Port 10.2 interrupt; Interrupt Flag: P10IFG2"/><bitenum id="P10IV__8" value="8" description="Interrupt Source: Port 10.3 interrupt; Interrupt Flag: P10IFG3"/><bitenum id="P10IV__16" value="10" description="Interrupt Source: Port 10.4 interrupt; Interrupt Flag: P10IFG4"/><bitenum id="P10IV__18" value="12" description="Interrupt Source: Port 10.5 interrupt; Interrupt Flag: P10IFG5"/><bitenum id="P10IV__20" value="14" description="Interrupt Source: Port 10.6 interrupt; Interrupt Flag: P10IFG6"/><bitenum id="P10IV__22" value="16" description="Interrupt Source: Port 10"/></bitfield></register><register id="PJIN" width="16" offset="0x120" internal="0" description="Port J Input"><bitfield id="PJIN" description="Port J Input" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJOUT" width="16" offset="0x122" internal="0" description="Port J Output"><bitfield id="PJOUT" description="Port J Output" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJDIR" width="16" offset="0x124" internal="0" description="Port J Direction"><bitfield id="PJDIR" description="Port J Direction&#13;&#10;0b = Port configured as input&#13;&#10;1b = Port conf" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJREN" width="16" offset="0x126" internal="0" description="Port J Resistor Enable"><bitfield id="PJREN" description="Port J pullup or pulldown resistor enable" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJDS" width="16" offset="0x128" internal="0" description="Port J Drive Strength"><bitfield id="PJDS" description="Port J drive strength selection (for high drive strength I/Os)" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJSEL0" width="16" offset="0x12A" internal="0" description="Port J Select 0"><bitfield id="PJSEL0" description="Port function selection" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJSEL1" width="16" offset="0x12C" internal="0" description="Port J Select 1"><bitfield id="PJSEL1" description="Port function selection" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="PJSELC" width="16" offset="0x136" internal="0" description="Port J Complement Select"><bitfield id="PJSELC" description="Port selection complement" begin="15" end="0" width="16" rwaccess="R/W"/></register></module>